[
{"name": "Watermelon Sugar", "meaning": "Its 2021 and why the actual fuck is this word still on trending?", "example": "Joe: Ayo have you heard of Watermelon Sugar?\rRick: Yeah why tf its still on trending?\rJoe: Idk but do you know who am I?\rRick: Joe who?", "likes": "4320", "dislikes": "552"},
{"name": "ghetto spread", "meaning": "ghetto spread is what you make in jail when you cant afford the ingredients for a real spreadINGREDIENTS\r1 - shrimp TOP RAMEN ( missing season packet because you used to season your eggs and potatoes for breakfast )\r1- bag of CLASSIC LAYS potato chipsINSTRUCTIONS\r- while water is boiling smash the fuck out of your bag of shrimp TOP RAMEN but be careful to not just throw bag on the ground like you would normally do because remember this one is missing your bag of seasoning. Dont want to fuck up your spread by throwing your noodles all over your cell.- add noodles to water and then once noodles are cooked spread your noodles out on plastic bag then pour your bag of CLASSIC LAYS ontop of your TOP RAMEN-say your prayer then eat alone and make sure you don't let any of the bums see you making this or else your hungry ass wont be eating alone", "example": "\"aye, TINY BABY FACE! after your break off for throwing your open bag of TOP RAMEN all over your celly, make sure to eat another ghetto spread for maximum results for your out date lil homie...and sound off when your done!!\"", "likes": "1160", "dislikes": "242"},
{"name": "Girls who eat carrots", "meaning": "A term, famously used by Louis Tomlinson, to represent girls who give good blow jobs", "example": "“What do one direction look for in a girl, now? What do we look for in a girl, boys? I like a girl whose got really really nice eyes. I like blue eyes.” Liam stated.\r“I like girls who eat carrots.“ Louis said bug-eyed causing the others to laugh.", "likes": "4683", "dislikes": "983"},
{"name": "sorority squat", "meaning": "Typically performed by sorority sisters immediately prior to a picture where one or more participants slightly bend their knees and lean on their calves with their arms regardless of whether or not people are behind them in the photo. Possibly used to accentuate the butt. Although scientists have still yet not found the origin or purpose of this tribal ritual, much discussion has been devoted to it's research. ", "example": "\"seriously, Becky is always bent over in all her pictures. You'd think she has scoliosis or something. I guess all those sorority squat pictures add up.\"", "likes": "3782", "dislikes": "364"},
{"name": "Durk", "meaning": "Neanderthal patriarch responsible for the great 20,000 BC fire party, having discovered wine an fire in close proximity, durk threw one hellacious rootin tootin wild cave party that 3/4 of the known world attended, it was a cave orgy of epic proportion, woolly mammoth cookouts an rock n rolling where just a few of the festivities....durk would be immortalized in many cave paintings around western an central europe, many thought to be pornographic in nature", "example": "Too Durk!!!!🍻🍻 Cheers!!!!", "likes": "632", "dislikes": "167"},
{"name": "Momala", "meaning": "Someone who isn't your mom but treats you with care...like a \"cool aunt\" but isn't related to you at all, normally a good friend of your mom", "example": "I had to catch up with my Momala, we had lunch talked about life she bought me this hat.", "likes": "844", "dislikes": "344"},
{"name": "Knocking", "meaning": "Something your family can’t do before they enter your room", "example": "*mother barges in bedroom whilst you’re in the middle of having sex*\rYou:”Holy shit mum, every heard of knocking”", "likes": "743", "dislikes": "56"},
{"name": "Dog shot", "meaning": "aussie def - to be hit when you are not looking", "example": "A girl asked for a hug and then her boyfriend came and dog shot me.", "likes": "1163", "dislikes": "262"},
{"name": "sputnik", "meaning": "A nickname for russian covid-19 vaccine", "example": "-Suka blyat! Vodka Putin for life, Ebal mamu pendosov.\r-The fuck is with that weirdo?\r-Oh don’t mind him, he got that Sputnik vaccine", "likes": "30", "dislikes": "9"},
{"name": "guvy", "meaning": "Toronto slag for Government name.", "example": "Teacher: Is Seth konan here?\rSK: yo fam who's calling me by my guvy", "likes": "554", "dislikes": "153"},
{"name": "Knock In", "meaning": "When someone knocks and then opens the door, defeating the whole purpose of knocking first. ", "example": "Guy: Dude, my mom tries to justify her barging in saying she knocked, but all she did was knock in. One of these days she's gonna catch me.", "likes": "234", "dislikes": "45"},
{"name": "nuke the fridge", "meaning": "Nuke the fridge is a colloquialism used to refer to the moment in a film series that is so incredible that it lessens the excitement of subsequent scenes that rely on more understated action or suspense, and it becomes apparent that a certain installment is not as good as a previous installments, due to ridiculous or low quality storylines, events or characters.\r The term comes from the film Indiana Jones and the Kingdom of the Crystal Skull, in which, near the start of the movie, Harrison Ford's character survives a nuclear detonation by climbing into a kitchen fridge, which is then blown hundreds of feet through the sky whilst the town disintegrates. He then emerges from the fridge with no apparent injury. Later in the movie, the audience is expected to fear for his safety in a normal fistfight.\r Fans of the Indiana Jones series found the absurdity of this event in the film to be the best example of the lower quality of this installment in the series, and thus coined the phrase, \"nuke the fridge\".\r The phrase is also a reference to the phrase \"jump the shark\", which has the same meaning, only applied to a television series instead of a film series.\r This phrase is not in common use.", "example": "\"Star Wars didn't really nuke the fridge until Jar Jar Binks was introduced.\"\r \"Peter Parker dancing around the bar in Spider-Man 3? Kinda nukes the fridge!\"\r \"The Godfather: Part III nukes the fridge.\"\r \"Gremlins 2 more or less nuked the fridge.\"", "likes": "5457", "dislikes": "898"},
{"name": "obnoxion", "meaning": "something extremely unpleasant.", "example": "it looks like obnoxion", "likes": "535", "dislikes": "119"},
{"name": "Eee-o eleven", "meaning": "1. A song by Sammy Davis Jr.2. A term for a perfect Craps game gone sour3. A Concept for which a person wishes and acheieves the perfect life. you have money, power and so many ways to show it off. With A block long limo with its driver, a penthouse with spending money laying about, and good looking people surrouding you. and then suddenly Its taken from you in an instant. like as if a single dice roll destroyed your life and your dreams.", "example": "Eee-o Eleven Strikes again ha ha with its patent pending tragic irony.", "likes": "238", "dislikes": "69"},
{"name": "edward 40 hands", "meaning": "When you tape a 40 to each hand and can't take them off until you are finishied drinking them.", "example": "I almost pissed myself last night during an intense game of edward 40 hands.", "likes": "2014", "dislikes": "296"},
{"name": "heels up", "meaning": "Refers to a woman on her back, usually naked, with her legs spread and feet in the air (i.e her heels are up in the air) and ready to engage in sexual intercourse.", "example": "I was hoping he'd fall \"head over heels\" in love with me, but all he was interested in was heels up, i.e. heels over head.", "likes": "1153", "dislikes": "205"},
{"name": "columbus", "meaning": "The largest city in Ohio.  If you haven't heard of it you are a fucking moron that has lived in a hole.", "example": "", "likes": "2683", "dislikes": "1449"},
{"name": "ain't got", "meaning": "rhythm", "example": "No I ain't got rhythm.", "likes": "1267", "dislikes": "122"},
{"name": "UrbDic", "meaning": "An abbreviation of Urban Dictionary", "example": "\"How the hell is Watermelon Sugar still trending on UrbDic!\"", "likes": "612", "dislikes": "31"},
{"name": "yak shaving", "meaning": "Any seemingly pointless activity which is actually necessary to solve a problem which solves a problem which, several levels of recursion later, solves the real problem you're working on.", "example": "origin: MIT AI Lab, after 2000: orig. probably from a Ren & Stimpy episode.", "likes": "1540", "dislikes": "157"},
{"name": "Rush B Cyka Blyat", "meaning": "Phrase used exclusively in CS:GO by angry russians forgetting all sense of logic and stop thinking straight", "example": "Teammate: 'We're losing what are we gonna do?'\rAngry russian : 'RUSH B CYKA BLYAT'", "likes": "3351", "dislikes": "250"},
{"name": "Pimp Nails", "meaning": "Long pinkey nails used to scoop and snort cocaine.", "example": "In 50 cent's P.I.M.P video snoop dogg was showing off his pimp nails", "likes": "1018", "dislikes": "152"},
{"name": "Backpedaling", "meaning": "Backpedaling is used when one is proven wrong in an arguement and don't want to get their ass whooped!Jessica: Why are you spreading rumors about me?Janice: I'm not spreading rumors about you!\rJessica: I seen it on your Facebook!\rJanice: That's all a misunderstanding....\rJessica: Don't start backpedaling now that you've been caught!", "example": "Janice started backpedaling her story when Jessica threatened to beat her ass!", "likes": "551", "dislikes": "77"},
{"name": "Anol", "meaning": "Scottish term for \"as well\". This can mainly be seen in Glasgow.", "example": "\"Fuck up ya dick or you'll be getting chibbed anol\".", "likes": "636", "dislikes": "163"},
{"name": "got that", "meaning": "another meaning for understood.", "example": "u: how many cans should i buy yo?\rur mom: 5, ok?\ru: got that.", "likes": "146", "dislikes": "37"},
{"name": "by the way", "meaning": "\"oh, and On that note,\" or \"While we're on the subject\" or \"since you mentioned it\" or \"Concerning that,\"", "example": "I can not wait to see you at Thanksgiving, Karolina. By the way, will you be eating the delicious pie I make?", "likes": "525", "dislikes": "164"},
{"name": "Wetter than an otter's pocket", "meaning": "A pickup line, usually used by males from the 90's with a cool Mexican mustache and a good hentai girl moan imitation. They usually hit on young people's middle-aged moms (just like Katsura), regardless of how the old woman looks.", "example": "Joe: Yo, are you Jojoe's Mom?\rJojoe's Mom: Why?\rJoe: Cause you smell wetter than an otter's pocket *very cool wink*\rJojoe's Mom: Omg marry me now", "likes": "1821", "dislikes": "566"},
{"name": "soy face", "meaning": "The face a nu-male makes when taking a selfie with his mouth gaping open.Also known as glory hole face.", "example": "Joe's always on instagram taking selfies with that really awkward soy face.", "likes": "2628", "dislikes": "478"},
{"name": "TSIF", "meaning": "That snail is fast", "example": "WOAH TSIF", "likes": "3499", "dislikes": "299"},
{"name": "georgia rose", "meaning": "When Urban Dictionary puts something as a top 30 definition but doesnt actually have a definition for that thing.", "example": "Me: When I was searching Urban Dictionary, I stumbled across the top 30 definition list. I clicked \"georgia rose\" and there was no definition for it.\rMe Again: wtf", "likes": "2307", "dislikes": "154"}
]
